/*
#Училище - Технологично училище „Електронни системи” към Технически университет – София
#Клас - 11Б
#Номер - 12
#Име - Даниела Алексова
#Задача - Програма,която изисква от потребителя да въведе целочислено число х, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери сумата от cos(z) за всяко z в интервала [0;x) и да се запише като първи елемент в масива. Да се намери сумата от cos(z) за всяко z в интервала [x; 2x) и да се запише като втори елемент в масива. Аналогично да се намерят сумите на cos(z) за всички интервали [Nx; (N+1)x ) и да се запишат като елемент N в масива за всяко N в интервала [0, 10). Масивът да се изведе на стандартния изход.
*/

#include <stdio.h>
#include <math.h>
int main()
{
int x,n,a,b,i=0;
double arr[10];
double sum=0;
double z,cosVal;
do
{
	printf("Enter number(0<x<10):");
	scanf("%d" , &x);
} while ( x < 0 || x >= 10 );

for (n=1;n<=10;n++)
{
a=n*x;
b=(n+1)*x;
	for (z=a;z<b;z++)
		{
		cosVal = cos(z);		
	 	sum=sum+cosVal;
		}
	arr[i]=sum;
	i++;
}

for ( i=0; i<=9 ;i++)
	{
	printf("%f\n", arr[i]);
	}
return 0;
}
