/*
#Училище - Технологично училище „Електронни системи” към Технически университет – София
#Клас - 11Б
#Номер - 12
#Име - Даниела Алексова
#Задача - Програма,която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери първото число N в интервала [0; +∞) делящо се на х. Да се намери сумата на всички числа в интервала [0; N] и да се запише като първи елемент в масива. Да се намери второто число N' в интервала [0; +∞) делящо се на x. Да се намери сумата на всички числа в интервала [0, N'] и да се запише като втори елемент в масива. Аналогично да се запълнят и останалите елементи на масива. Масивът да се изведе на стандартния изход.
*/

#include <stdio.h>
int main()
{
int x,n,sum=0,i=0;
int arr[10];
int max=100000;
{
	printf("Enter number(x>0):");
	scanf("%d" , &x);
} while (x<0);	

for (n=0;n<max;n++)
{
	sum=sum+n;
	if (n%x==0)
		{
		arr[i]=sum;
		i++;
		}
}
for ( i=0; i<=9 ;i++)
	{
	printf("%d\n", arr[i]);
	}
return 0;
}
