/*
#Училище - Технологично училище „Електронни системи” към Технически университет – София
#Клас - 11Б
#Номер - 12
#Име - Даниела Алексова
#Задача - Програма,която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери сумата от всички числа в интервала [0; 1000) делящи се на x и да се запише като първа стойност в масива. Да се намери сумата от всички числа в интервала [0;1000) деляща се на 2x и да се запише като втора стойност в масива. Аналогично да се намери сумата на всички числа делящи се на Nx за N в интервала [1;10] и да се запишат като елемент N-1 в масива. Масивът да се изведе на стандартния изход.
*/

#include <stdio.h>
int main()
{
int x,a,n,z;
int arr[10];
int max=1000,sum=0,i=0;
do
{
	printf("Enter number(0<x<10):");
	scanf("%d" , &x);
} while ( x < 0 || x >= 10 );

for (n=1;n<=10;n++)
{
	for (a=0;a<max;a++)
		{
		z=n*x;
		if (a%z==0)
	 	sum=sum+a;
				}
	arr[i]=sum;
	i++;
}

for ( i=0; i<=9 ;i++)
	{
	printf("%d\n", arr[i]);
	}
return 0;
}
