/*
#Училище - Технологично училище „Електронни системи” към Технически университет – София
#Клас - 11Б
#Номер - 12
#Име - Даниела Алексова
#Задача - Програма,която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери първото число на Фибоначи в интервала [0; +∞) завършващо на x и да се запише като първи елемент в масива. Да се намери второто число на Фибоначи в интервала [0;  +∞) завършващо на x и да се запише като втори елемент в масива. Аналогично да се намерят първите N прости числа в интервала [0;  +∞) и да се запишат като елемент N в масива. Масивът да се изведе на стандартния изход.
*/

#include <stdio.h>
int main()
{
int x,next,c; 
int arr[10];
int f = 0, s = 1, i=0, n=10000000;
do
{
	printf("Enter number(0<x<10):");
	scanf("%d" , &x);
} while ( x < 0 || x >= 10 );
 

   for ( c = 0 ; c<n  ; c++ )
   {
      if ( c <= 1 )
         next = c;
      else
      {
         next = f + s;
         f = s;
         s = next;
      }

     if ( next%10 == x)
		{
		if (i==10) break;
		arr[i]=next;
		i++;
		}

   }
for ( i=0; i<=9 ;i++)
	{
	printf("%d\n", arr[i]);
	}
   

return 0;

}
