/*
#Училище - Технологично училище „Електронни системи” към Технически университет – София
#Клас - 11Б
#Номер - 12
#Име - Даниела Алексова
#Задача - Програма,която изисква от потребителя да въведе целочислено число x, където x e интервала [0; +∞). Да се намерят първите 10 нечетни числа делители на x и да се запишат в масив. Масивът да се изведе на екрана и да се намерят простите числа в този масив.
*/

#include <stdio.h>
int main()
{
int i,x,z,n=0;
int arr[10];
do
{
	printf("Enter number(x>0):");
	scanf("%d" , &x);
} while (x<0);	

for (i=1;i<=x;i++)
{
	if (x%i==0)
	{
		if (i%2!=0)
		{
		arr[n]=i;
		n++;
		}
	}
}
	
for ( n=0; n<=9 ;n++)
	{
	printf("%d\n", arr[n]);
	}
printf("Prostite chisla sa:\n");
for ( n=0; n<=9 ;n++)
	{
	for ( z = 2 ; z < arr[n]; z++ )
		{
      		if ( arr[n]%z == 0 )
      		break;
   		}
  	if ( z == arr[n] )
   	printf("%d\n", arr[n]);
	}

return 0;
}
