/*
#Училище - Технологично училище „Електронни системи” към Технически университет – София
#Клас - 11Б
#Номер - 12
#Име - Даниела Алексова
#Задача - Програма, която изисква от потребителя да въведе целочислено число x, където 0<=x<10. Да се инициализира масив от 10 елемента. Да се намерят първите 10 стойности на функцията cos(x) в интервала [0; +∞), в които третата цифра след десетичната запетая е x. Пример при cos(1) = 0.540302306 третата цифра след десетичната запетая е 0. При cos(2) = -0.416146837 третата цифра след десетичната запетая е 6. Намерените стойности да се зададат като стойности на елементите в масива. Елементите на масива да се изведат на стандартния изход.
*/

#include <stdio.h>
#include <math.h>
int main()
{
int x,i,z;
double arr[10];
double y=0,n,cosVal;
do
{
	printf("Enter number(0<=x<10):");
	scanf("%d" , &x);
} while ( x >= 10 );
 
for(i = 0; i < 10; i++)
{
		do
		{
			cosVal = cos(y);
			y++;
			n=cosVal*1000;
			z=n;
                        z=z%10;
		}while( cosVal < 0 || x != z );
		arr[i] = cosVal;
		
}

for ( i=0; i<=9 ;i++)
	{
	printf("%f\n", arr[i]);
	}
return 0;
}


















