/*
#Училище - Технологично училище „Електронни системи” към Технически университет – София
#Клас - 11Б
#Номер - 12
#Име - Даниела Алексова
#Задача - Програма,която изисква от потребителя да въведе число x, където 0<x<1. Да се намери числото пи чрез следното развитие в ред:
4-4/3+4/5-4/7+4/9-4/11+...4/N. Развитието в ред спира при 4/N<x. Получената стойност за пи да се изведе на екрана.
*/

#include <stdio.h>
int main()
{
int n=1;
float x,i;
double pi= 4.00f,z;
do
{
	printf("Enter number(0<x<1):");
	scanf("%f" , &x);
} while ( x < 0 || x >= 1);

for( i = 3; 4/i > x; i+=2 )
{
		z=i;
		if( (n % 2) != 0 )
			{
			pi =pi-4/z;
			}
		else
			{
			pi =pi+4/z;
			}
		n++;
}


printf("pi=%f\n",pi);
return 0;
}
